OpenFOAM/OpenFOAM-7/tutorials/heatTransfer/chtMultiRegionFoam/shellAndTubeHeatExchanger/0/tube/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/tube";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.0064879;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    lower
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.008;
        value           $internalField;
    }
    upper
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
